{
  "app.title": "Pablo Vidal Portfolio",

  "nav.home": "Home",
  "nav.projects": "Projects",
  "nav.about": "About",
  "nav.contact": "Contact",

  "home.hero.kicker": "Full-Stack Developer focused on end-to-end systems",
  "home.hero.title": "Hi, I'm Pablo.",
  "home.hero.subtitle": "I build web and mobile applications covering frontend, backend, and database layers, with a strong focus on clear structure, solid validations, and overall system consistency.",
  "home.hero.cta.projects": "View projects",
  "home.hero.cta.contact": "Contact me",

  "home.highlight.title": "What you'll find here",
  "home.highlight.body": "Full-stack projects where I worked across the entire system lifecycle: domain modeling, state management, backend validations, and clear separation of responsibilities.",

  "projects.title": "Projects",
  "projects.subtitle": "Applications built with a strong focus on structure, business flow, and clean architecture.",
  "projects.empty.helper": "New projects will be added here as they are consolidated.",

  "projects.common.role": "Role",
  "projects.common.context": "Context",
  "projects.common.responsibilities": "Responsibilities",

  "projects.actions.viewLive": "View demo",
  "projects.actions.viewRepo": "View repository",
  "projects.actions.moreInfo": "More information",

  "projects.detail.backToList": "Back to projects",
  "projects.detail.problem": "Problem",
  "projects.detail.solution": "Solution",
  "projects.detail.responsibilities": "Responsibilities",
  "projects.detail.tech": "Technologies",
  "projects.detail.notFound": "Project not found.",

  "projects.items.debAndLopers.title": "Deb&Lopers – State-Driven Restaurant Management System",
  "projects.items.debAndLopers.shortDescription": "Full-stack system with role-based access control and an order flow modeled as a state machine.",
  "projects.items.debAndLopers.role": "Full-Stack Developer",
  "projects.items.debAndLopers.context": "Academic project (UTN · PPS) focused on architecture, backend validations, and mobile experience.",
  "projects.items.debAndLopers.responsibilities": "Modeled the order lifecycle as a state machine, implemented role-based access control, centralized business logic in services, and enforced server-side validations to prevent invalid state transitions.",
  "projects.items.debAndLopers.detail.problem": "The main challenge was coordinating multiple actors (customer, waiter, and kitchen) while preventing inconsistencies in the order workflow. Without strict rules, orders could reach invalid states, be duplicated, or move forward without proper validation.",
  "projects.items.debAndLopers.detail.solution": "I modeled the order lifecycle as an explicit state machine with controlled transitions. Every state change is validated on the backend, ensuring role consistency and preventing manipulation from the frontend.",
  "projects.items.debAndLopers.detail.responsibilities": "Defined the data model and state transition rules, centralized business logic in services as the single source of truth, and structured role-based access with clearly separated frontend and backend responsibilities.",

  "projects.items.clinicaOnline.title": "Online Clinic – Medical Management System",
  "projects.items.clinicaOnline.shortDescription": "Full-stack application for appointment and patient management with structured permission control and validations.",
  "projects.items.clinicaOnline.role": "Full-Stack Developer",
  "projects.items.clinicaOnline.context": "Academic project focused on modularization, security, and separation of responsibilities.",
  "projects.items.clinicaOnline.responsibilities": "Designed the data model, implemented session and permission control, enforced backend validations, and organized the system in a modular and maintainable structure.",
  "projects.items.clinicaOnline.detail.problem": "The main challenge was organizing appointment and patient management while preventing scheduling conflicts, unauthorized access, and inconsistent system states.",
  "projects.items.clinicaOnline.detail.solution": "I structured the system into independent modules with centralized backend validations. Role-based access control and clear business rules ensured safe creation and modification of appointments.",
  "projects.items.clinicaOnline.detail.responsibilities": "Designed the data model, defined business rules for appointments and users, implemented server-side validations, and structured the architecture with a clear separation between logic, data, and presentation.",

  "projects.items.salaDeJuegos.title": "Game Room – Interactive Application with State Management",
  "projects.items.salaDeJuegos.shortDescription": "Interactive application with multiple game modes and real-time ranking.",
  "projects.items.salaDeJuegos.role": "Front-End Developer",
  "projects.items.salaDeJuegos.context": "Academic project focused on frontend state management and user experience.",
  "projects.items.salaDeJuegos.responsibilities": "Implemented game logic, synchronized data with Firestore, and optimized frontend state handling and performance.",
  "projects.items.salaDeJuegos.detail.problem": "The challenge was maintaining consistent scoring and ranking while multiple users interacted in real time, avoiding frontend state inconsistencies.",
  "projects.items.salaDeJuegos.detail.solution": "I implemented explicit state handling for each game and controlled synchronization with Firestore to ensure consistent ranking updates.",
  "projects.items.salaDeJuegos.detail.responsibilities": "Developed game logic, structured frontend state management, and optimized database communication to reduce inconsistencies.",

  "projects.items.portfolio.title": "Professional Portfolio",
  "projects.items.portfolio.shortDescription": "Personal website designed to present projects with a technical and structural focus.",
  "projects.items.portfolio.role": "Front-End Developer",
  "projects.items.portfolio.context": "Personal project deployed on GitHub Pages.",
  "projects.items.portfolio.responsibilities": "Designed the site architecture, implemented a custom translation system, built a responsive layout, and structured content with a clean and scalable approach.",
  "projects.items.portfolio.detail.problem": "The goal was to build a portfolio that not only showcased projects but also reflected structural clarity, technical coherence, and architectural consistency.",
  "projects.items.portfolio.detail.solution": "I designed a modular architecture with a custom translation system, feature-based structure, and standalone Angular components.",
  "projects.items.portfolio.detail.responsibilities": "Implemented a custom i18n system with dynamic loading, structured routes by functional domain, and maintained visual and structural consistency across the site.",

  "about.title": "About",
  "about.body": "I am a full-stack developer focused on understanding systems holistically. I am particularly interested in proper domain modeling, separation of responsibilities, and building maintainable solutions.",
  "about.extra": "I work with Angular and TypeScript, and I aim to deepen my expertise in structured backend development and architectural best practices.",

  "contact.title": "Contact",
  "contact.body": "You can reach me by email or through my professional profiles.",
  "contact.email.label": "Email",
  "contact.github.label": "GitHub",
  "contact.linkedin.label": "LinkedIn"
}
