{
  "app.title": "Portfolio de Pablo Vidal",

  "nav.home": "Inicio",
  "nav.projects": "Proyectos",
  "nav.about": "Sobre mí",
  "nav.contact": "Contacto",

  "home.hero.kicker": "Desarrollador Fullstack orientado a sistemas completos",
  "home.hero.title": "Hola, soy Pablo.",
  "home.hero.subtitle": "Desarrollo aplicaciones web y móviles abarcando frontend, backend y base de datos, con foco en estructura clara, validaciones sólidas y funcionamiento integral del sistema.",
  "home.hero.cta.projects": "Ver proyectos",
  "home.hero.cta.contact": "Contactarme",

  "home.highlight.title": "Qué vas a encontrar acá",
  "home.highlight.body": "Proyectos fullstack donde trabajé el ciclo completo del sistema: modelado de dominio, manejo de estados, validaciones backend y separación de responsabilidades.",

  "projects.title": "Proyectos",
  "projects.subtitle": "Aplicaciones desarrolladas con enfoque en estructura, flujo de negocio y arquitectura clara.",
  "projects.empty.helper": "Aquí iré incorporando nuevos proyectos a medida que los consolide.",
  "projects.common.role": "Rol",
  "projects.common.context": "Contexto",
  "projects.common.responsibilities": "Responsabilidades",

  "projects.actions.viewLive": "Ver demo",
  "projects.actions.viewRepo": "Ver repositorio",
  "projects.actions.moreInfo": "Más información",

  "projects.detail.backToList": "Volver a proyectos",
  "projects.detail.problem": "Problema",
  "projects.detail.solution": "Solución",
  "projects.detail.responsibilities": "Responsabilidades",
  "projects.detail.tech": "Tecnologías",
  "projects.detail.notFound": "Proyecto no encontrado.",

  "projects.items.debAndLopers.title": "Deb&Lopers - Sistema de gestión con modelado de estados",
  "projects.items.debAndLopers.shortDescription": "Sistema fullstack con control de acceso por roles y flujo de pedidos modelado mediante máquina de estados.",
  "projects.items.debAndLopers.role": "Desarrollador fullstack",
  "projects.items.debAndLopers.context": "Proyecto académico (UTN · PPS) enfocado en arquitectura, validaciones backend y experiencia móvil.",
  "projects.items.debAndLopers.responsibilities": "Modelado del flujo de pedidos como máquina de estados, implementación de control de acceso por roles, centralización de lógica en servicios y validaciones server-side para evitar transiciones inválidas.",
  "projects.items.debAndLopers.detail.problem": "El desafío principal era coordinar múltiples actores (cliente, mozo y cocina) evitando inconsistencias en el flujo de pedidos. Sin reglas claras, un pedido podía quedar en estados inválidos, duplicarse o avanzar sin validación adecuada.",
  "projects.items.debAndLopers.detail.solution": "Modelé el flujo de pedidos como una máquina de estados con transiciones explícitas y controladas. Cada cambio de estado se valida en backend, garantizando coherencia entre roles y evitando manipulaciones desde el frontend.",
  "projects.items.debAndLopers.detail.responsibilities": "Definí el modelo de datos y las reglas de transición de estados, centralicé la lógica de negocio en servicios como única fuente de verdad y estructuré el acceso por roles con responsabilidades claramente delimitadas entre frontend y backend.",

  "projects.items.clinicaOnline.title": "Clínica Online - Sistema de gestión médica",
  "projects.items.clinicaOnline.shortDescription": "Aplicación fullstack para gestión de turnos y pacientes con control de permisos y validaciones estructuradas.",
  "projects.items.clinicaOnline.role": "Desarrollador fullstack",
  "projects.items.clinicaOnline.context": "Proyecto académico con foco en modularización, seguridad y separación de responsabilidades.",
  "projects.items.clinicaOnline.responsibilities": "Diseño del modelo de datos, implementación de control de sesiones y permisos, validaciones backend y organización modular del sistema.",

  "projects.items.salaDeJuegos.title": "Sala de Juegos - Aplicación interactiva con manejo de estado",
  "projects.items.salaDeJuegos.shortDescription": "Aplicación lúdica con múltiples dinámicas y ranking en tiempo real.",
  "projects.items.salaDeJuegos.role": "Desarrollador front-end",
  "projects.items.salaDeJuegos.context": "Proyecto académico enfocado en manejo de estado y experiencia de usuario.",
  "projects.items.salaDeJuegos.responsibilities": "Implementación de lógica de juego, sincronización con Firestore y optimización de estado en frontend.",

  "projects.items.portfolio.title": "Portfolio profesional",
  "projects.items.portfolio.shortDescription": "Sitio personal diseñado para presentar proyectos con enfoque estructural y técnico.",
  "projects.items.portfolio.role": "Desarrollador front-end",
  "projects.items.portfolio.context": "Proyecto personal publicado con GitHub Pages.",
  "projects.items.portfolio.responsibilities": "Arquitectura del sitio, sistema de traducciones personalizado, diseño responsive y organización estructural del contenido.",

  "about.title": "Sobre mí",
  "about.body": "Soy desarrollador fullstack con foco en entender el sistema de forma integral. Me interesa modelar correctamente el dominio, separar responsabilidades y construir soluciones mantenibles.",
  "about.extra": "Trabajo con Angular y TypeScript, y me interesa seguir profundizando en backend estructurado y buenas prácticas de arquitectura.",

  "contact.title": "Contacto",
  "contact.body": "Podés contactarme por email o a través de mis perfiles profesionales.",
  "contact.email.label": "Email",
  "contact.github.label": "GitHub",
  "contact.linkedin.label": "LinkedIn"
}
