{
  "app.title": "Portfolio de Pablo Vidal",

  "nav.home": "Accueil",
  "nav.projects": "Projets",
  "nav.about": "À propos",
  "nav.contact": "Contact",

  "home.hero.kicker": "Développeur fullstack orienté systèmes complets",
  "home.hero.title": "Bonjour, je suis Pablo.",
  "home.hero.subtitle": "Je développe des applications web et mobiles couvrant le frontend, le backend et la base de données, avec un fort accent sur la structure, les validations solides et la cohérence globale du système.",
  "home.hero.cta.projects": "Voir les projets",
  "home.hero.cta.contact": "Me contacter",

  "home.highlight.title": "Ce que vous trouverez ici",
  "home.highlight.body": "Des projets fullstack couvrant tout le cycle du système : modélisation du domaine, gestion d'état et validations backend.",

  "projects.title": "Projets",
  "projects.subtitle": "Applications développées avec un fort accent sur la structure et l'architecture propre.",
  "projects.empty.helper": "De nouveaux projets seront ajoutés progressivement.",

  "projects.common.role": "Rôle",
  "projects.common.context": "Contexte",
  "projects.common.responsibilities": "Responsabilités",

  "projects.actions.viewLive": "Voir la démo",
  "projects.actions.viewRepo": "Voir le dépôt",
  "projects.actions.moreInfo": "Plus d'informations",

  "projects.detail.backToList": "Retour aux projets",
  "projects.detail.problem": "Problème",
  "projects.detail.solution": "Solution",
  "projects.detail.responsibilities": "Responsabilités",
  "projects.detail.tech": "Technologies",
  "projects.detail.notFound": "Projet introuvable.",

  "projects.items.debAndLopers.title": "Deb&Lopers – Système de gestion de restaurant basé sur une machine d'états",
  "projects.items.debAndLopers.shortDescription": "Système fullstack avec contrôle d'accès par rôles et flux de commandes modélisé comme une machine d'états.",
  "projects.items.debAndLopers.role": "Développeur fullstack",
  "projects.items.debAndLopers.context": "Projet académique axé sur l'architecture et les validations backend.",
  "projects.items.debAndLopers.responsibilities": "Modélisation du cycle de vie des commandes, contrôle d'accès par rôles et centralisation de la logique métier.",
  "projects.items.debAndLopers.detail.problem": "Le principal défi consistait à coordonner plusieurs acteurs (client, serveur et cuisine) tout en évitant les incohérences dans le flux des commandes. Sans règles claires, une commande pouvait atteindre des états invalides, être dupliquée ou progresser sans validation appropriée.",
  "projects.items.debAndLopers.detail.solution": "J’ai modélisé le cycle de vie des commandes comme une machine d’états avec des transitions explicites et contrôlées. Chaque changement d’état est validé côté backend, garantissant la cohérence entre les rôles et empêchant toute manipulation depuis le frontend.",
  "projects.items.debAndLopers.detail.responsibilities": "Définition du modèle de données et des règles de transition d’états, centralisation de la logique métier dans des services comme source unique de vérité (single source of truth) et structuration de l’accès par rôles avec une séparation claire des responsabilités entre frontend et backend.",

  "projects.items.clinicaOnline.title": "Online Clinic – Système de gestion médicale",
  "projects.items.clinicaOnline.shortDescription": "Application fullstack pour la gestion des rendez-vous et des patients.",
  "projects.items.clinicaOnline.role": "Développeur fullstack",
  "projects.items.clinicaOnline.context": "Projet académique axé sur la modularité et la sécurité.",
  "projects.items.clinicaOnline.responsibilities": "Conception du modèle de données et validations backend.",
  "projects.items.clinicaOnline.detail.problem": "Le principal défi était d'organiser la gestion des rendez-vous et des patients tout en évitant les conflits d'horaires, les accès non autorisés et les états incohérents du système.",
  "projects.items.clinicaOnline.detail.solution": "J'ai structuré le système en modules indépendants avec des validations backend centralisées et un contrôle d'accès basé sur les rôles.",
  "projects.items.clinicaOnline.detail.responsibilities": "Conception du modèle de données, définition des règles métier pour les rendez-vous, implémentation des validations serveur et séparation claire entre logique, données et présentation.",

  "projects.items.salaDeJuegos.title": "Game Room – Application interactive avec gestion d'état",
  "projects.items.salaDeJuegos.shortDescription": "Application interactive avec plusieurs modes de jeu.",
  "projects.items.salaDeJuegos.role": "Développeur frontend",
  "projects.items.salaDeJuegos.context": "Projet académique orienté expérience utilisateur.",
  "projects.items.salaDeJuegos.responsibilities": "Implémentation de la logique de jeu.",
  "projects.items.salaDeJuegos.detail.problem": "Le défi consistait à maintenir la cohérence du score et du classement en temps réel tout en évitant les incohérences d'état côté frontend.",
  "projects.items.salaDeJuegos.detail.solution": "Mise en place d'une gestion explicite de l'état et synchronisation contrôlée avec Firestore.",
  "projects.items.salaDeJuegos.detail.responsibilities": "Implémentation de la logique de jeu et optimisation de la gestion d'état frontend.",

  "projects.items.portfolio.title": "Portfolio professionnel",
  "projects.items.portfolio.shortDescription": "Site personnel présentant des projets avec un focus technique.",
  "projects.items.portfolio.role": "Développeur frontend",
  "projects.items.portfolio.context": "Projet personnel publié sur GitHub Pages.",
  "projects.items.portfolio.responsibilities": "Architecture du site et système de traduction personnalisé.",
  "projects.items.portfolio.detail.problem": "L'objectif était de créer un portfolio reflétant non seulement les projets, mais aussi la clarté structurelle et la cohérence architecturale.",
  "projects.items.portfolio.detail.solution": "Architecture modulaire avec système de traduction personnalisé et composants Angular standalone.",
  "projects.items.portfolio.detail.responsibilities": "Implémentation d'un système i18n personnalisé, structuration des routes par domaine fonctionnel et maintien de la cohérence visuelle.",

  "about.title": "À propos",
  "about.body": "Développeur fullstack intéressé par la modélisation correcte des systèmes et la séparation des responsabilités.",
  "about.extra": "Je travaille avec Angular et TypeScript et approfondis l'architecture backend.",

  "contact.title": "Contact",
  "contact.body": "Vous pouvez me contacter par email ou via mes profils professionnels.",
  "contact.email.label": "Email",
  "contact.github.label": "GitHub",
  "contact.linkedin.label": "LinkedIn"
}
